<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [212]:
import pandas as pd
import psycopg2
import requests
from bs4 import BeautifulSoup

In [213]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python

In [214]:
connection = psycopg2.connect(
    dbname='project_sql',
    user='skillfactory',
    host='84.201.134.129',
    password='cCkxxLVrDE8EbvjueeMedPKt',
    port=5432
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [215]:
# текст запроса
query_3_1 = f'''
SELECT count(*)
FROM vacancies    
'''

In [216]:
# результат запроса
vac_df = pd.read_sql_query(query_3_1, connection)
vac_df

D:\Temp\ipykernel_288\3752011682.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  vac_df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [217]:
# текст запроса
query_3_2 = f'''
SELECT distinct count(id)
FROM employers   
'''

In [218]:
# результат запроса
emp_df = pd.read_sql_query(query_3_2, connection)
emp_df

D:\Temp\ipykernel_288\719013263.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  emp_df = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [219]:
# текст запроса
query_3_3 = f"""
SELECT distinct count(name)
FROM areas   
"""

In [220]:
# результат запроса
area_df = pd.read_sql_query(query_3_3, connection)
area_df

D:\Temp\ipykernel_288\879523715.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  area_df = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [221]:
# текст запроса
query_3_4 = f"""
SELECT distinct count(id)
FROM industries   
            """

In [222]:
# результат запроса
ind_df = pd.read_sql_query(query_3_4, connection)
ind_df

D:\Temp\ipykernel_288\3199698201.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  ind_df = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

In [223]:
# выводы по предварительному анализу данных

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [224]:
# текст запроса
query_4_1 = f"""
SELECT
    area.name,
    count(v.id) AS cnt
FROM areas AS area
    LEFT JOIN vacancies AS v ON area.id = v.area_id
GROUP BY area.name
ORDER BY cnt DESC
LIMIT 5   
"""

In [225]:
# результат запроса
regions_df = pd.read_sql_query(query_4_1, connection)
regions_df

D:\Temp\ipykernel_288\359069637.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  regions_df = pd.read_sql_query(query_4_1, connection)

              name   cnt
0           Москва  5333
1  Санкт-Петербург  2851
2            Минск  2112
3      Новосибирск  2006
4           Алматы  1892

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [226]:
# текст запроса
query_4_2 = f"""
SELECT                
    COUNT(v.id) AS cnt
FROM vacancies AS v
WHERE v.salary_from IS NOT NULL OR v.salary_to IS NOT NULL
                        
"""

In [227]:
# результат запроса
sal_df = pd.read_sql_query(query_4_2, connection)
sal_df

D:\Temp\ipykernel_288\2994334641.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sal_df = pd.read_sql_query(query_4_2, connection)

     cnt
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [228]:
# текст запроса
query_4_3 = f"""
SELECT                
    AVG(v.salary_from) AS avg_salary_from,
    AVG(v.salary_to) AS avg_salary_to
FROM vacancies AS v              
"""

In [229]:
# результат запроса
avg_sal_df = pd.read_sql_query(query_4_3, connection)
# округляем значения avg_salary_from & avg_salary_to до целых
avg_sal_df['avg_salary_from'] = avg_sal_df['avg_salary_from'].round(0)
avg_sal_df['avg_salary_to'] = avg_sal_df['avg_salary_to'].round(0)
avg_sal_df

D:\Temp\ipykernel_288\3651007603.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  avg_sal_df = pd.read_sql_query(query_4_3, connection)

   avg_salary_from  avg_salary_to
0          71065.0       110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [230]:
# текст запроса
query_4_4 = f"""
SELECT              
    v.schedule,
    v.employment,
    COUNT(v.id) AS cnt
FROM vacancies AS v 
GROUP BY v.schedule, v.employment
ORDER by cnt desc                
OFFSET 1
LIMIT 1
                             
"""

In [231]:
# результат запроса
sh_emp_df = pd.read_sql_query(query_4_4, connection)
sh_emp_df

D:\Temp\ipykernel_288\2205611185.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sh_emp_df = pd.read_sql_query(query_4_4, connection)

           schedule        employment   cnt
0  Удаленная работа  Полная занятость  7802

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [232]:
# текст запроса
query_4_5 = f"""
SELECT             
    v.experience,
    COUNT(v.id) AS cnt
FROM vacancies AS v 
GROUP BY v.experience
ORDER by cnt                                                       
"""

In [233]:
# результат запроса
expiriece_df = pd.read_sql_query(query_4_5, connection)
expiriece_df

D:\Temp\ipykernel_288\586667203.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  expiriece_df = pd.read_sql_query(query_4_5, connection)

           experience    cnt
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [234]:
# выводы по детальному анализу вакансий

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [235]:
# текст запроса
query_5_1 = f"""
SELECT             
    e.name AS employer_name,
    COUNT(v.employer_id) AS cnt
FROM employers AS e
    JOIN vacancies AS v ON e.id = v.employer_id
GROUP BY e.name
ORDER by cnt DESC          
                                            
"""

In [236]:
# результат запроса
employers_df = pd.read_sql_query(query_5_1, connection)
employers_df

D:\Temp\ipykernel_288\405853397.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employers_df = pd.read_sql_query(query_5_1, connection)

                employer_name   cnt
0                      Яндекс  1933
1                  Ростелеком   491
2                    Тинькофф   444
3                        СБЕР   428
4               Газпром нефть   331
...                       ...   ...
14761            им. Тьюринга     1
14762        LLC Novalab Tech     1
14763   Компания Мир упаковки     1
14764  Лифинцев Олег Иванович     1
14765      ТрансЭнергоХолдинг     1

[14766 rows x 2 columns]

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [237]:
# текст запроса

query_5_2 = f"""
SELECT 
    area_employers.area_name,
    area_employers.employers_count,
    COUNT(v.id) AS vacancies_count
FROM (
SELECT
    area.name AS area_name,
    area.id AS area_id,
    COUNT(DISTINCT e.id) AS employers_count                     
FROM areas AS area
LEFT JOIN employers AS e ON e.area = area.id                
GROUP BY area_id, area.name) AS area_employers
                
LEFT JOIN vacancies AS v ON area_employers.area_id = v.area_id
GROUP BY area_employers.area_name, area_employers.employers_count
HAVING area_employers.employers_count > 0 and COUNT(v.id) = 0
ORDER BY area_employers.employers_count DESC                                                      
"""

In [238]:
# результат запроса
no_employers_df = pd.read_sql_query(query_5_2, connection)
no_employers_df

D:\Temp\ipykernel_288\1219629096.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  no_employers_df = pd.read_sql_query(query_5_2, connection)

                       area_name  employers_count  vacancies_count
0                         Россия              410                0
1                      Казахстан              207                0
2             Московская область               75                0
3             Краснодарский край               19                0
4                       Беларусь               18                0
..                           ...              ...              ...
181                    Филиппины                1                0
182                  Дальнегорск                1                0
183  Майна (Ульяновская область)                1                0
184                      Светлый                1                0
185                       Ангрен                1                0

[186 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [239]:
# текст запроса
query_5_3 = f"""
SELECT             
    emp.name AS employer_name,
    COUNT(DISTINCT vac.area_id) AS cnt
FROM vacancies AS vac 
    JOIN employers AS emp ON vac.employer_id = emp.id                   
GROUP BY emp.name
ORDER by cnt DESC          
                                            
"""

In [240]:
# результат запроса
vac_area_df = pd.read_sql_query(query_5_3, connection)
vac_area_df.rename(columns={'cnt': 'vacancies_count'}, inplace=True)
vac_area_df

D:\Temp\ipykernel_288\2716859742.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  vac_area_df = pd.read_sql_query(query_5_3, connection)

                employer_name  vacancies_count
0                      Яндекс              181
1                  Ростелеком              152
2                  Спецремонт              116
3      Поляков Денис Иванович               88
4                   ООО ЕФИН                71
...                       ...              ...
14761                  UniSol                1
14762            UNISTORY LLC                1
14763                   UNIT6                1
14764     United Distribution                1
14765              UNITEL LLC                1

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [241]:
# текст запроса
query_5_4 = f"""
SELECT COUNT(DISTINCT emp.id) AS cnt                     
FROM employers AS emp 
    LEFT JOIN employers_industries AS ei ON emp.id = ei.employer_id 
    LEFT JOIN industries AS ind ON ei.industry_id = ind.id 
WHERE ind.name IS NULL                                                                                    
"""

In [242]:
# результат запроса
employers_industries_not_verify_df = pd.read_sql_query(query_5_4, connection)
employers_industries_not_verify_df

D:\Temp\ipykernel_288\2446699455.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employers_industries_not_verify_df = pd.read_sql_query(query_5_4, connection)

    cnt
0  8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [243]:
# текст запроса
query_5_5 = f"""
SELECT            
    emp.name AS employer_name,
    COUNT(emp.id) AS cnt
FROM employers AS emp 
    LEFT JOIN employers_industries AS ei ON emp.id = ei.employer_id 
    LEFT JOIN industries AS ind ON ei.industry_id = ind.id 
WHERE ind.name IS NOT NULL 
GROUP BY emp.name 
HAVING COUNT(emp.id) = 4
ORDER BY emp.name
OFFSET 2
LIMIT 1                                                                                                         
"""

In [244]:
# результат запроса
employers_industries_verify_df = pd.read_sql_query(query_5_5, connection)
employers_industries_verify_df

D:\Temp\ipykernel_288\1535529697.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employers_industries_verify_df = pd.read_sql_query(query_5_5, connection)

  employer_name  cnt
0          2ГИС    4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [245]:
# текст запроса
query_5_6 = f"""
SELECT                     
    COUNT(ind.id) AS cnt
FROM employers AS emp 
    LEFT JOIN employers_industries AS ei ON emp.id = ei.employer_id 
    LEFT JOIN industries AS ind ON ei.industry_id = ind.id 
WHERE ind.name = 'Разработка программного обеспечения'                
"""

In [246]:
# результат запроса
employers_software_dev_df = pd.read_sql_query(query_5_6, connection)

employers_software_dev_df

D:\Temp\ipykernel_288\549338585.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employers_software_dev_df = pd.read_sql_query(query_5_6, connection)

    cnt
0  3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [247]:
# текст запроса
# Скачиваем таблицы с википедии
url = "https://ru.wikipedia.org/wiki/Города-миллионеры_России"
tables = pd.read_html(requests.get(url).text)

# Первая таблица содержит нужные данные
million_cities = tables[0]["Город"].tolist()
million_cities = [city.split("[")[0].strip() for city in million_cities]
million_cities
# для компании Яндекс вывести список городов из million_cities c количеством вакансий в этих городах, также добавить строку Total с общим количеством вакансий в этих городах
query_5_7 = f"""
SELECT                     
    a.name AS area_name,
    COUNT(v.id) AS cnt
FROM vacancies AS v
    JOIN areas AS a ON v.area_id = a.id
WHERE v.employer_id = (SELECT id FROM employers WHERE name = 'Яндекс')
    AND a.name IN {tuple(million_cities)}
GROUP BY v.area_id, a.name
ORDER BY cnt DESC
"""

D:\Temp\ipykernel_288\1101379592.py:4: FutureWarning: Passing literal html to 'read_html' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  tables = pd.read_html(requests.get(url).text)

In [248]:
# результат запроса
# Получаем данные по количеству вакансий Яндекса в городах-миллионниках
yandex_million_cities_df = pd.read_sql_query(query_5_7, connection)

# Добавляем строку Total с общим количеством вакансий
total_row = pd.DataFrame(
    {"area_name": ["Total"], "cnt": [yandex_million_cities_df["cnt"].sum()]}
)
yandex_million_cities_df = pd.concat(
    [yandex_million_cities_df, total_row], ignore_index=True
)

yandex_million_cities_df

D:\Temp\ipykernel_288\4055613090.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  yandex_million_cities_df = pd.read_sql_query(query_5_7, connection)

          area_name  cnt
0            Москва   54
1   Санкт-Петербург   42
2      Екатеринбург   39
3   Нижний Новгород   36
4       Новосибирск   35
5           Воронеж   32
6         Краснодар   30
7            Самара   26
8               Уфа   26
9            Казань   25
10            Пермь   25
11   Ростов-на-Дону   25
12        Волгоград   24
13       Красноярск   23
14        Челябинск   22
15             Омск   21
16            Total  485

***

In [249]:
# выводы по анализу работодателей

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [250]:
# текст запроса
query_6_1 = f"""
SELECT COUNT(*) data_vacancies_count
FROM vacancies
WHERE LOWER(name) LIKE '%data%' OR LOWER(name) LIKE '%данн%'
"""

In [251]:
# результат запроса
data_vacancies_count_df = pd.read_sql_query(query_6_1, connection)
data_vacancies_count_df

D:\Temp\ipykernel_288\1018682303.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data_vacancies_count_df = pd.read_sql_query(query_6_1, connection)

   data_vacancies_count
0                  1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [252]:
# текст запроса
query_6_2 = f"""
SELECT COUNT(*) AS junior_ds_vacancies_count
FROM vacancies
WHERE (
    LOWER(name) LIKE '%data scientist%' OR
    LOWER(name) LIKE '%data science%' OR
    LOWER(name) LIKE '%исследователь данных%' OR
    (LOWER(name) LIKE '%ml%' AND LOWER(name) NOT LIKE '%html%') OR
    LOWER(name) LIKE '%machine learning%' OR
    (LOWER(name) LIKE '%машинн%' AND LOWER(name) LIKE '%обучен%')
)
AND (
    LOWER(name) LIKE '%junior%' OR
    experience = 'Нет опыта' OR
    employment = 'Стажировка'
)
"""

In [253]:
# результат запроса
junior_ds_vacancies_count_df = pd.read_sql_query(query_6_2, connection)
junior_ds_vacancies_count_df

D:\Temp\ipykernel_288\3920599332.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  junior_ds_vacancies_count_df = pd.read_sql_query(query_6_2, connection)

   junior_ds_vacancies_count
0                         51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [254]:
# текст запроса
query_6_3 = f"""
SELECT COUNT(*) AS ds_sql_postgres_count
FROM vacancies v
--JOIN key_skills ks ON v.id = ks.vacancy_id
WHERE (
    LOWER(v.name) LIKE '%data scientist%' OR
    LOWER(v.name) LIKE '%data science%' OR
    LOWER(v.name) LIKE '%исследователь данных%' OR
    (LOWER(v.name) LIKE '%ml%' AND LOWER(v.name) NOT LIKE '%html%') OR
    LOWER(v.name) LIKE '%machine learning%' OR
    (LOWER(v.name) LIKE '%машинн%' AND LOWER(v.name) LIKE '%обучен%')
)
AND (
    LOWER(v.key_skills) LIKE '%sql%' OR
    LOWER(v.key_skills) LIKE '%postgres%'
)
"""

In [255]:
# результат запроса
sql_postgres_count_df = pd.read_sql_query(query_6_3, connection)
sql_postgres_count_df

D:\Temp\ipykernel_288\695317930.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sql_postgres_count_df = pd.read_sql_query(query_6_3, connection)

   ds_sql_postgres_count
0                    229

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [256]:
# текст запроса
query_6_4 = f"""
SELECT COUNT(*) AS ds_python_count
FROM vacancies v
--JOIN key_skills ks ON v.id = ks.vacancy_id
WHERE (
    LOWER(v.name) LIKE '%data scientist%' OR
    LOWER(v.name) LIKE '%data science%' OR
    LOWER(v.name) LIKE '%исследователь данных%' OR
    (LOWER(v.name) LIKE '%ml%' AND LOWER(v.name) NOT LIKE '%html%') OR
    LOWER(v.name) LIKE '%machine learning%' OR
    (LOWER(v.name) LIKE '%машинн%' AND LOWER(v.name) LIKE '%обучен%')
)
AND 
    LOWER(v.key_skills) LIKE '%python%'
"""

In [257]:
# результат запроса
ds_python_count_df = pd.read_sql_query(query_6_4, connection)
ds_python_count_df

D:\Temp\ipykernel_288\1759156160.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  ds_python_count_df = pd.read_sql_query(query_6_4, connection)

   ds_python_count
0              357

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?

Ответ округлите до двух знаков после точки-разделителя.

In [258]:
# текст запроса
query_6_5 = f"""
SELECT 
    v.key_skills AS key_skills
FROM vacancies v
WHERE LOWER(v.name) LIKE '%data scientist%' OR  
    LOWER(v.name) LIKE '%data science%' OR
    LOWER(v.name) LIKE '%исследователь данных%' OR
    (name LIKE '%ML%' AND name NOT LIKE '%HTML%')  OR
    LOWER(v.name) LIKE '%machine learning%' OR
    (LOWER(v.name) LIKE '%машинн%' AND LOWER(v.name) LIKE '%обучен%')
    AND v.key_skills IS NOT NULL

"""

In [ ]:
# результат запроса
key_skills_df = pd.read_sql_query(query_6_5, connection)

# удалить строки с пустыми значениями в столбце key_skills
key_skills_df = key_skills_df.dropna(subset=["key_skills"])


# Функция для подсчета слов в строке, разделяя по \t
def count_words(skills):
    if pd.isna(skills):
        return 0
    return len(skills.split("\t"))


key_skills_df["key_skills_count"] = key_skills_df["key_skills"].apply(count_words)

# Считаем среднее количество ключевых навыков
average_key_skills_count = key_skills_df["key_skills_count"].mean()

# Округляем до двух знаков после точки-разделителя
average_key_skills_count = round(average_key_skills_count, 2)

# Выводим результат
print(
    f"Среднее количество ключевых навыков в вакансиях Data Scientist: {average_key_skills_count}"
)

In [ ]:
# текст запроса
query_6_5_sql = f"""
SELECT 
    ROUND(AVG(LENGTH(key_skills) - LENGTH(REPLACE(key_skills, CHR(9), '')) + 1), 2) AS avg_key_skills_count
FROM vacancies
WHERE (
    LOWER(name) LIKE '%data scientist%' OR  
    LOWER(name) LIKE '%data science%' OR
    LOWER(name) LIKE '%исследователь данных%' OR
    (name LIKE '%ML%' AND name NOT LIKE '%HTML%')  OR
    LOWER(name) LIKE '%machine learning%' OR
    (LOWER(name) LIKE '%машинн%' AND LOWER(name) LIKE '%обучен%')
)
AND key_skills IS NOT NULL
"""
# Результат запроса
avg_key_skills_count_df = pd.read_sql_query(query_6_5_sql, connection)
avg_key_skills_count_df

D:\Temp\ipykernel_288\171805863.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  avg_key_skills_count_df = pd.read_sql_query(query_6_5_sql, connection)

   avg_key_skills_count
0                  6.41

In [ ]:
# результат запроса
key_skills_df = pd.read_sql_query(query_6_5, connection)

# удалить строки с пустыми значениями в столбце key_skills
key_skills_df = key_skills_df.dropna(subset=['key_skills'])

# Функция для подсчета слов в строке, разделяя по \t
def count_words(skills):
    if pd.isna(skills):
        return 0
    return len(skills.split('\t'))
key_skills_df['key_skills_count'] = key_skills_df['key_skills'].apply(count_words)

# Считаем среднее количество ключевых навыков
average_key_skills_count = key_skills_df['key_skills_count'].mean()

# Округляем до двух знаков после точки-разделителя
average_key_skills_count = round(average_key_skills_count, 2)

# Выводим результат
print(f"Среднее количество ключевых навыков в вакансиях Data Scientist: {average_key_skills_count}")

D:\Temp\ipykernel_288\2719094534.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  key_skills_df = pd.read_sql_query(query_6_5, connection)

Среднее количество ключевых навыков в вакансиях Data Scientist: 6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [267]:
# текст запроса

query_6_6_1 = f"""
SELECT 
    experience,
    ROUND(AVG(
        CASE 
            WHEN salary_from IS NOT NULL AND salary_to IS NOT NULL THEN (salary_from + salary_to) / 2.0
            WHEN salary_from IS NOT NULL THEN salary_from
            WHEN salary_to IS NOT NULL THEN salary_to
        END
    )) AS avg_salary
FROM vacancies
WHERE (
    LOWER(name) LIKE '%data scientist%' OR
    LOWER(name) LIKE '%data science%' OR
    LOWER(name) LIKE '%исследователь данных%' OR
    (name LIKE '%ML%' AND name NOT LIKE '%HTML%') OR
    LOWER(name) LIKE '%machine learning%' OR
    (LOWER(name) LIKE '%машинн%' AND LOWER(name) LIKE '%обучен%')  
)
AND (salary_from IS NOT NULL OR salary_to IS NOT NULL)
GROUP BY experience
ORDER BY avg_salary DESC
"""

In [268]:
# результат запроса
exp_count_df = pd.read_sql_query(query_6_6_1, connection)
exp_count_df

D:\Temp\ipykernel_288\67075217.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  exp_count_df = pd.read_sql_query(query_6_6_1, connection)

           experience  avg_salary
0       От 3 до 6 лет    243115.0
1  От 1 года до 3 лет    139675.0
2           Нет опыта     74643.0

***

In [ ]:
# выводы по предметному анализу

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования